[
    {
      "key": "SimpleHeroBanner",
      "name": "SimpleHeroBanner",
      "type": "SimpleHeroBanner",
      "items": [
        {
          "key": "title",
          "type": "text",
          "content": "Terms & Conditions"
        },
        {
          "key": "subtitle",
          "type": "text",
          "content": ""
        }
      ]
    },
    {
      "key": "sectionTOS",
      "name": "Term & Condition",
      "type": "array",
      "items": [
        {
          "key": "updatedDate",
          "type": "text",
          "content": "September 10, 2025"
        },
        {
          "key": "TosHeading1",
          "type": "heading",
          "level": 2,
          "content": "1. Introduction"
        },
        {
          "key": "TosDescription1",
          "type": "text",
          "content": "These Terms and Conditions (\"<span style=\"font-weight: bold;\">Terms</span>\") govern your use of the Diora Spa by Michelle Tran website and services. By accessing our website, booking appointments, or using our services, you agree to be bound by these Terms. If you disagree with any part of the Terms, you may not access our website or use our services."
        },
        {
          "key": "TosHeading2",
          "type": "heading",
          "level": 2,
          "content": "2. Services"
        },
        {
          "key": "TosDescription2",
          "type": "text",
          "content": "Diora Spa by Michelle Tran provides various spa services including but not limited to head spa treatments, waxing, laser hair removal, and eyelash extensions. All services are subject to availability and may be modified or discontinued at any time without prior notice."
        },
        {
          "key": "TosDescription3",
          "type": "text",
          "content": "Our services are provided by trained professionals. However, results may vary depending on individual factors such as skin type, hair type, and adherence to aftercare instructions."
        },
        {
          "key": "TosHeading3",
          "type": "heading",
          "level": 2,
          "content": "3. Appointments and Cancellations"
        },
        {
          "key": "TosDescription4",
          "type": "text",
          "content": "Appointments can be made online through our website, by phone, or in person. We recommend booking in advance to secure your preferred time slot."
        },
        {
          "key": "TosDescription5",
          "type": "text",
          "content": "<strong>Cancellation Policy:</strong> If you need to cancel or reschedule your appointment, please do so at least 24 hours in advance. Cancellations made less than 24 hours before the scheduled appointment may be subject to a cancellation fee of 50% of the service price. No-shows will be charged the full service price."
        },
        {
          "key": "TosDescription6",
          "type": "text",
          "content": "We reserve the right to refuse service to anyone for any reason at any time."
        },
        {
          "key": "TosHeading4",
          "type": "heading",
          "level": 2,
          "content": "4. Health and Safety"
        },
        {
          "key": "TosDescription7",
          "type": "text",
          "content": "Your health and safety are our priority. Before receiving any treatment, you may be required to complete a consultation form disclosing relevant health information. It is your responsibility to inform us of any medical conditions, allergies, or medications that may affect your treatment."
        },
        {
          "key": "TosDescription8",
          "type": "text",
          "content": "We reserve the right to refuse service if we believe a treatment may be unsafe for you based on the information provided or observed."
        },
        {
          "key": "TosHeading5",
          "type": "heading",
          "level": 2,
          "content": "5. Payment and Pricing"
        },
        {
          "key": "TosDescription9",
          "type": "text",
          "content": "All prices are displayed in Singapore Dollars (SGD) and are inclusive of GST. Prices are subject to change without prior notice. The current price at the time of your appointment will apply."
        },
        {
          "key": "TosDescription10",
          "type": "text",
          "content": "Payment is due at the time of service. We accept cash, major credit cards, and electronic payment methods such as PayNow."
        },
        {
          "key": "TosDescription11",
          "type": "text",
          "content": "Gift certificates and prepaid packages are non-refundable but may be transferable with prior approval from management."
        },
        {
          "key": "TosHeading6",
          "type": "heading",
          "level": 2,
          "content": "6. Liability"
        },
        {
          "key": "TosDescription12",
          "type": "text",
          "content": "While we strive to provide the highest quality services, we cannot guarantee specific results. By using our services, you acknowledge that there are inherent risks associated with spa treatments. Diora Spa by Michelle Tran and its staff shall not be liable for any direct, indirect, incidental, special, or consequential damages resulting from the use of our services."
        },
        {
          "key": "TosHeading7",
          "type": "heading",
          "level": 2,
          "content": "7. Personal Belongings"
        },
        {
          "key": "TosDescription13",
          "type": "text",
          "content": "We recommend that you do not bring valuable items to your appointment. Diora Spa by Michelle Tran is not responsible for any loss or damage to personal belongings while on our premises."
        },
        {
          "key": "TosHeading8",
          "type": "heading",
          "level": 2,
          "content": "8. Behavior and Conduct"
        },
        {
          "key": "TosDescription14",
          "type": "text",
          "content": "We are committed to providing a safe, comfortable, and respectful environment for all clients and staff. Inappropriate behavior, harassment, or abuse towards our staff or other clients will not be tolerated and may result in immediate termination of service without refund and potential legal action."
        },
        {
          "key": "TosHeading9",
          "type": "heading",
          "level": 2,
          "content": "9. Intellectual Property"
        },
        {
          "key": "TosDescription15",
          "type": "text",
          "content": "All content on our website, including text, graphics, logos, images, and software, is the property of Diora Spa by Michelle Tran and is protected by copyright and other intellectual property laws. You may not reproduce, distribute, modify, or create derivative works from any content without our express written consent."
        },
        {
          "key": "TosHeading10",
          "type": "heading",
          "level": 2,
          "content": "10. Privacy"
        },
        {
          "key": "TosDescription16",
          "type": "text",
          "content": "Your privacy is important to us. Please refer to our Privacy Policy for information on how we collect, use, and protect your personal data."
        },
        {
          "key": "TosHeading11",
          "type": "heading",
          "level": 2,
          "content": "11. Changes to Terms"
        },
        {
          "key": "TosDescription17",
          "type": "text",
          "content": "We reserve the right to modify these Terms at any time. Changes will be effective immediately upon posting on our website. Your continued use of our services after any changes indicates your acceptance of the modified Terms."
        },
        {
          "key": "TosHeading12",
          "type": "heading",
          "level": 2,
          "content": "12. Governing Law"
        },
        {
          "key": "TosDescription18",
          "type": "text",
          "content": "These Terms shall be governed by and construed in accordance with the laws of Singapore. Any disputes arising under these Terms shall be subject to the exclusive jurisdiction of the courts of Singapore."
        },
        {
          "key": "TosHeading13",
          "type": "heading",
          "level": 2,
          "content": "13. Contact Us"
        },
        {
          "key": "TosDescription19",
          "type": "text",
          "content": "If you have any questions about these Terms, please contact us at:<br />Email: dioraspabymichelletran@gmail.com<br />Phone: +65 9224 6789<br />Address: 14 Scotts Rd, #05-80 Far East Plaza, Singapore 228213"
        }
      ]
    }
  ]